Herimarque-soap-client/request/age_img_list_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:head="http://apache.org/headers" xmlns:ser="http://service.agecrlts.crlts.cha/">
   <soapenv:Header>
      <head:ComMsgHeader>
         <RequestMsgID>netinamu42</RequestMsgID>
         <ServiceKey>6i1zuQWddVTMFSqlHyhnbw8VL7uvfuHHt3Pth12H3VuFrUvdzFRcfYBZRfTE0Eidf/hV3otAz36MR1F/VDWUDw==</ServiceKey>
      </head:ComMsgHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getAgeCrltsImage>
         <!--Optional:-->
         <arg0>
         	<nowPageNo>pageNum</nowPageNo>
         	<pageMg>size</pageMg>
           <itemCd>code</itemCd>
           <crltsNo>number</crltsNo>
           <ctrdCd>locale</ctrdCd> 
         </arg0>
      </ser:getAgeCrltsImage>
   </soapenv:Body>
</soapenv:Envelope>